# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Sat Apr 11 13:35:46 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1000ps

# Set the current design
current_design rename_unit

create_clock -name "clk" -period 3.33 -waveform {0.0 1.665} [get_ports clk]
set_clock_transition 0.05 [get_clocks clk]
set_load -pin_load 10.0 [get_ports rename_stall]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[exec_unit_uop][5]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[exec_unit_uop][4]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[exec_unit_uop][3]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[exec_unit_uop][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[exec_unit_uop][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[exec_unit_uop][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[func_unit_type][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[func_unit_type][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[instr_class][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[instr_class][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[instr_class][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[cause][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[cause][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][31]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][30]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][29]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][28]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][27]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][26]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][25]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][24]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][23]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][22]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][21]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][20]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][19]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][18]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][17]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][16]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][15]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][14]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][13]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][12]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][11]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][10]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][9]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][8]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][7]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][6]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][5]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][4]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][3]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[predicted_pc][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][31]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][30]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][29]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][28]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][27]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][26]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][25]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][24]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][23]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][22]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][21]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][20]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][19]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][18]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][17]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][16]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][15]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][14]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][13]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][12]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][11]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][10]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][9]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][8]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][7]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][6]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][5]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][4]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][3]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[imm_val][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][31]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][30]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][29]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][28]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][27]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][26]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][25]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][24]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][23]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][22]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][21]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][20]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][19]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][18]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][17]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][16]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][15]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][14]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][13]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][12]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][11]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][10]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][9]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][8]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][7]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][6]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][5]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][4]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][3]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[pc][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[except]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[reg_we]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[valid]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src2_valid]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src1_valid]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src2][5]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src2][4]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src2][3]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src2][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src2][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src2][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src1][5]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src1][4]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src1][3]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src1][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src1][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_src1][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_dest][5]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_dest][4]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_dest][3]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_dest][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_dest][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[p_dest][0]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[old_p_dest][5]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[old_p_dest][4]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[old_p_dest][3]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[old_p_dest][2]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[old_p_dest][1]}]
set_load -pin_load 10.0 [get_ports {rename_dispatch_out[old_p_dest][0]}]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports rename_stall]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[exec_unit_uop][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[exec_unit_uop][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[exec_unit_uop][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[exec_unit_uop][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[exec_unit_uop][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[exec_unit_uop][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[func_unit_type][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[func_unit_type][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[instr_class][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[instr_class][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[instr_class][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[cause][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[cause][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[predicted_pc][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[imm_val][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[pc][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[except]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[reg_we]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[valid]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src2_valid]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src1_valid]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src2][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src2][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src2][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src2][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src2][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src2][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src1][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src1][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src1][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src1][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src1][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_src1][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_dest][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_dest][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_dest][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_dest][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_dest][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[p_dest][0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[old_p_dest][5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[old_p_dest][4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[old_p_dest][3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[old_p_dest][2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[old_p_dest][1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.999 [get_ports {rename_dispatch_out[old_p_dest][0]}]
set_max_fanout 32.000 [current_design]
set_max_transition 0.2 [current_design]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports rst_n]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[exec_unit_uop][5]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[exec_unit_uop][4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[exec_unit_uop][3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[exec_unit_uop][2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[exec_unit_uop][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[exec_unit_uop][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[func_unit_type][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[func_unit_type][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[instr_class][2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[instr_class][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[instr_class][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[cause][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[cause][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[except]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src2][4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src2][3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src2][2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src2][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src2][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src1][4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src1][3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src1][2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src1][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_src1][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_dst][4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_dst][3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_dst][2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_dst][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[r_dst][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][31]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][30]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][29]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][28]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][27]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][26]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][25]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][24]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][23]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][22]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][21]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][20]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][19]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][18]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][17]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][16]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][15]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][14]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][13]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][12]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][11]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][10]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][9]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][8]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][7]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][6]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][5]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[imm_val][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][31]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][30]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][29]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][28]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][27]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][26]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][25]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][24]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][23]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][22]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][21]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][20]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][19]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][18]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][17]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][16]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][15]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][14]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][13]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][12]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][11]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][10]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][9]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][8]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][7]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][6]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][5]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[predicted_pc][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][31]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][30]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][29]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][28]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][27]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][26]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][25]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][24]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][23]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][22]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][21]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][20]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][19]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][18]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][17]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][16]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][15]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][14]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][13]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][12]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][11]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][10]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][9]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][8]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][7]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][6]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][5]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[pc][0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[valid]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[src2_valid]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {decode_rename_in[src1_valid]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports branch_mispredict]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports commit_valid]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_rd[4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_rd[3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_rd[2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_rd[1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_rd[0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_pd[5]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_pd[4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_pd[3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_pd[2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_pd[1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_pd[0]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_old_pd[5]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_old_pd[4]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_old_pd[3]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_old_pd[2]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_old_pd[1]}]
set_driving_cell -lib_cell INV_X1 -library NangateOpenCellLibrary -pin "ZN" [get_ports {commit_old_pd[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.15 [get_clocks clk]
set_clock_uncertainty -hold 0.15 [get_clocks clk]
